# frozen_string_literal: true

tap 'hashicorp/tap'

cask_args adopt: true, require_sha: true

brew 'actionlint'
brew 'ansible'
brew 'ansible-language-server'
brew 'ansible-lint'
brew 'bat'
brew 'black'
brew 'checkmake'
brew 'chezmoi'
brew 'clang-format'
brew 'coreutils'
brew 'd2'
brew 'diffutils'
brew 'direnv'
brew 'docker'
brew 'docker-buildx'
brew 'docker-credential-helper'
brew 'docker-credential-helper-ecr'
brew 'dockerfmt'
brew 'dos2unix'
brew 'dotenv-linter'
brew 'editorconfig-checker'
brew 'eslint'
brew 'exiftool'
brew 'eza'
brew 'fd'
brew 'flake8'
brew 'flock'
cask 'font-jetbrains-mono'
cask 'font-symbols-only-nerd-font'
brew 'fx'
brew 'fzf'
brew 'gh'
cask 'ghostty', appdir: '~/Applications', greedy: true
brew 'git-crypt'
brew 'git-filter-repo'
brew 'git-lfs'
brew 'git-trim'
brew 'gitlint'
brew 'glow'
brew 'gnu-sed'
brew 'gnu-tar'
brew 'go'
brew 'golangci-lint'
brew 'golangci-lint-langserver'
# cask 'google-chrome', appdir: '~/Applications', greedy: true
brew 'gopls'
# brew 'goreleaser'
brew 'gpg2'
brew 'grafana-alloy'
brew 'graphviz'
brew 'gron'
brew 'hadolint'
brew 'hashicorp/tap/packer'
brew 'hashicorp/tap/terraform'
brew 'hashicorp/tap/terraform-ls'
brew 'hcl2json'
brew 'helm'
brew 'imagemagick'
brew 'ipcalc'
brew 'jdupes'
brew 'jsonlint'
brew 'keyring'
brew 'krew'
brew 'kube-linter'
brew 'kubecolor'
brew 'kubeconform'
brew 'kubectx'
brew 'kubent'
brew 'kubernetes-cli'
brew 'kustomize'
brew 'less'
brew 'lua-language-server'
brew 'luacheck'
brew 'luarocks'
brew 'markdownlint-cli'
brew 'mermaid-cli'
brew 'mkdocs'
# brew 'mkdocs-material'
# cask 'monitorcontrol', appdir: '~/Applications', greedy: true
brew 'neovim'
brew 'parallel'
brew 'pinentry-mac'
brew 'pipx'
brew 'pre-commit'
brew 'prettier'
brew 'protobuf'
brew 'protoc-gen-go'
brew 'pstree'
brew 'pwgen'
brew 'pyright'
brew 'python-argcomplete'
brew 'qrencode'
cask 'rectangle', appdir: '~/Applications', greedy: true
brew 'rg'
brew 'sf-pwgen'
brew 'shellcheck'
brew 'shfmt'
brew 'skopeo'
brew 'sops'
brew 'starship'
brew 'stylua'
brew 'telnet'
brew 'terramate'
brew 'texinfo'
brew 'tf-summarize'
brew 'tflint'
brew 'tfupdate'
brew 'trivy'
brew 'trufflehog'
brew 'typescript'
cask 'utm', appdir: '~/Applications'
brew 'vint'
brew 'virtualenv'
brew 'vscode-langservers-extracted'
brew 'watch'
brew 'wdiff'
brew 'wireguard-tools'
brew 'yaml-language-server'
brew 'yamale'
brew 'yamlfmt'
brew 'yamllint'
brew 'yarn'
brew 'yj'
brew 'yq'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

if '{{ .where }}' == 'home'
  tap 'UpCloudLtd/tap'

  brew 'b2-tools'
  cask 'calibre', appdir: '~/Applications'
  cask 'chatbox', appdir: '~/Applications'
  cask 'chatgpt', appdir: '~/Applications', greedy: true
  cask 'container'
  brew 'cvs'
  brew 'duckdb'
  brew 'gemini-cli'
  brew 'goyacc'
  cask 'hush', appdir: '~/Applications'
  cask 'mudlet', appdir: '~/Applications'
  brew 'ollama'
  cask 'orbstack', appdir: '~/Applications'
  cask 'oversight', appdir: '~/Applications'
  brew 'perl'
  brew 'scw'
  brew 'ssh-audit'
  brew 'upcloud-cli'
  brew 'vultr'
  brew 'yasm'
  brew 'yubico-piv-tool'
  brew 'yubikey-personalization'
end

if '{{ .where }}' == 'work'
  brew 'argocd'
  brew 'aws-vault'
  brew 'awscli'
  brew 'awsdac'
  brew 'bfg'
  brew 'colima'
  cask 'google-drive', appdir: '~/Applications', greedy: true
  brew 'gradle'
  brew 'iam-policy-json-to-terraform'
  brew 'istioctl'
  brew 'kubectl-argo-rollouts'
  brew 'mysql-client@8.0'
  brew 'openjdk'
  brew 'poetry'
  brew 'postgresql@14'
  brew 'postgresql@15'
  cask 'slack', appdir: '~/Applications', greedy: true
  brew 'terraform-iam-policy-validator'
end

# vim: ft=ruby.gotmpl
