# frozen_string_literal: true

tap "hashicorp/tap"

cask_args adopt: true

brew "actionlint"
brew "ansible"
brew "ansible-language-server"
brew "ansible-lint"
brew "bat"
brew "bfg"
brew "black"
brew "ccusage"
brew "checkmake"
brew "chezmoi"
brew "cidr"
brew "clang-format"
cask "claude-code", require_sha: true
brew "container", restart_service: :always
brew "container-compose"
brew "coreutils"
brew "diffutils"
brew "direnv"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "dockerfmt"
brew "dos2unix"
brew "dotenv-linter"
brew "editorconfig-checker"
brew "eslint"
brew "exiftool"
brew "fd"
brew "flake8"
brew "flock"
cask "font-jetbrains-mono", require_sha: true
cask "font-symbols-only-nerd-font", require_sha: true
brew "fzf"
brew "gawk"
brew "gh"
cask "ghostty", appdir: "~/Applications", greedy: true, require_sha: true
brew "git-delta"
brew "git-filter-repo"
brew "git-lfs"
brew "git-trim"
brew "gitlint"
brew "glow"
brew "gnu-sed"
brew "gnu-tar"
brew "go"
brew "gopls"
brew "gofumpt"
brew "goimports"
brew "golangci-lint"
brew "golangci-lint-langserver"
cask "google-analytics-opt-out", require_sha: true
brew "gpg2"
brew "grafana-alloy"
brew "graphviz"
brew "gron"
brew "gum"
brew "hadolint"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "hcl2json"
brew "hcledit"
brew "htmlhint"
brew "inetutils"
brew "ipcalc"
brew "jsonlint"
brew "k9s"
brew "keyring"
brew "krew"
brew "kubecolor"
brew "kubeconform"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "less"
brew "luacheck"
brew "luarocks"
brew "markdownlint-cli"
brew "mas"
brew "mermaid-cli"
brew "mise"
brew "mkdocs-material"
# cask "monitorcontrol", appdir: "~/Applications", greedy: true, require_sha: true
brew "mtr"
brew "neovim"
brew "opencode"
cask "orbstack", greedy: true, require_sha: true
cask "orion", greedy: true, require_sha: true
brew "parallel"
brew "pinentry-mac"
brew "pipx"
brew "pnpm"
brew "pre-commit"
brew "prek"
brew "prettier"
brew "pstree"
brew "pwgen"
brew "qrencode"
cask "rectangle", greedy: true, require_sha: true
brew "ripgrep"
brew "rsync"
brew "sf-pwgen"
brew "shellcheck"
brew "shfmt"
brew "socat"
brew "starship"
brew "stylua"
brew "terramate"
brew "terraform-mcp-server"
brew "texinfo"
brew "tf-summarize"
brew "tfclean"
# brew "tflint" -- FIXME
brew "tfupdate"
brew "tree-sitter-cli"
brew "typescript"
cask "utm", appdir: "~/Applications", require_sha: true
brew "uv"
brew "vint"
brew "virtualenv"
brew "watch"
brew "wdiff"
brew "websocat"
brew "wget"
brew "yamale"
brew "yamlfmt"
brew "yamllint"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

krew "get-all"

mas "Keynote", id: 361285480
mas "Numbers", id: 361304891
mas "Pages", id: 361309726

if "{{ .where }}" == "home"
  tap "fluxcd/tap"

  brew "age"
  brew "b2-tools"
  cask "bitwarden", appdir: "~/Applications", require_sha: true
  brew "bitwarden-cli"
  cask "calibre", appdir: "~/Applications", require_sha: true
  brew "cpanminus"
  brew "cdrtools"
  brew "cvs"
  brew "docker-squash"
  brew "fluxcd/tap/flux"
  brew "flyctl"
  brew "git-credential-oauth"
  brew "git-crypt"
  brew "gitea-mcp-server"
  brew "hcloud"
  brew "helm@3"
  brew "hugo"
  brew "immich-cli"
  brew "kubernetes-mcp-server"
  brew "mtools"
  cask "oversight", require_sha: true
  brew "perl"
  brew "perltidy"
  brew "popeye"
  brew "qemu"
  brew "scw"
  brew "sops"
  brew "step"
  cask "synology-drive", appdir: "~/Applications", require_sha: true
  brew "tea"
  # brew "tintin"
  cask "ungoogled-chromium", appdir: "~/Applications", require_sha: true
  brew "vultr"
  # cask "wine-stable", require_sha: true
  # brew "winetricks"
  brew "ykman"
  brew "yubico-piv-tool"

  mas "1Blocker", id: 1365531024
  mas "Apple Configurator", id: 1037126344
  mas "Clean Links", id: 6747395062
  mas "DaisyDisk", id: 411643860
  mas "Discovery", id: 1381004916
  mas "Hush", id: 1544743900
  mas "Microsoft Word", id: 462054704

  # 1123795278  Civilization VI     (1.4.7)
  # 408981434  iMovie              (10.4.4)
end

if "{{ .where }}" == "work"
  # cask "1password", greedy: true, require_sha: true
  # brew "amazon-ecs-cli"
  # cask "aws-vpn-client", greedy: true, require_sha: true
  brew "awscli"
  # cask "google-drive", appdir: "~/Applications", greedy: true, require_sha: true
  # brew "gradle"
  # brew "liquibase"
  cask "logitech-camera-settings", appdir: "~/Applications", require_sha: true
  # brew "mysql-client@8.0"
  # brew "openjdk"
  # brew "poetry"
  # brew "postgresql@14"
  # brew "postgresql@15"
  cask "slack", appdir: "~/Applications", greedy: true, require_sha: true
end
